content/emacs-configs.org
#+TITLE: Emacs Configurations
#+AUTHOR: Kyeong Soo Choi
#+STARTUP: overview
#+PROPERTY: header-args :emacs-lisp :mkdirp yes :results none

* Early Init

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;;; early-init.el --- Emacs-Solo (no external packages) Configuration  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;; Early init configuration for Emacs-Solo
  ;;; Code:

  ;; Startup hacks
  (setq gc-cons-threshold most-positive-fixnum
  	  gc-cons-percentage 0.6
  	  vc-handled-backends '(Git))

  ;; Hack to avoid being flashbanged
  (defun emacs-solo/avoid-initial-flash-of-light ()
    "Avoid flash of light when starting Emacs."
    (setq mode-line-format nil)
    ;; These colors should match your selected theme for maximum effect
    ;; Note that for catppuccin whenever we create a new frame or open it on terminal
    ;; it is necessary to reload the theme.
    ;; (set-face-attribute 'default nil :background "#292D3E" :foreground "#292D3E")
    )

  (emacs-solo/avoid-initial-flash-of-light)

  ;; Better Window Management handling
  (setq frame-resize-pixelwise t
  	  frame-inhibit-implied-resize t
  	  frame-title-format '("Emacs"))

  (setq inhibit-compacting-font-caches t)

  ;; Disables unused UI Elements
  (menu-bar-mode 0)
  (scroll-bar-mode 0)
  (tool-bar-mode 0)
  (tooltip-mode 0)

  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we easily halve startup times with fonts that are
  ;; larger than the system default.
  (setq frame-inhibit-implied-resize t
  	  frame-resize-pixelwise t)

  (provide 'early-init)
  ;;; early-init.el ends here

#+end_src

