emacs-configs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configurations</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1">

</head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-3xl md:max-w-4xl lg:max-w-5xl xl:max-w-6xl px-4 sm:px-6 lg:px-8">
<h1 class="title">Emacs Configurations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgef1f260">1. Early Init</a></li>
<li><a href="#org29fb8e2">2. Init</a></li>
<li><a href="#org4d476e5">3. Theme</a></li>
<li><a href="#orgde03f9b">4. Window</a></li>
<li><a href="#orgec4fb25">5. Completion</a></li>
<li><a href="#org8f7aaa0">6. Dired</a></li>
<li><a href="#org235bda8">7. Note</a></li>
<li><a href="#orgf2d5588">8. Shell</a></li>
<li><a href="#org9321940">9. Programming</a></li>
<li><a href="#org680ad3f">10. Miscellaneous</a></li>
<li><a href="#org7db2ec4">11. Linux</a></li>
<li><a href="#orgd49250d">12. MacOS</a></li>
<li><a href="#org6b17a99">13. Windows</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgef1f260" class="outline-2">
<h2 id="orgef1f260"><span class="section-number-2">1.</span> Early Init</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">early-init.el --- Emacs-Solo (no external packages) Configuration  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Early init configuration for Emacs-Solo
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Startup hacks
</span>(<span class="org-keyword">setq</span> gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6
        vc-handled-backends '(Git))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Hack to avoid being flashbanged
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">emacs-solo/avoid-initial-flash-of-light</span> ()
  <span class="org-doc">"Avoid flash of light when starting Emacs."</span>
  (<span class="org-keyword">setq</span> mode-line-format nil)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">These colors should match your selected theme for maximum effect
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">Note that for catppuccin whenever we create a new frame or open it on terminal
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">it is necessary to reload the theme.
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(set-face-attribute 'default nil :background "#292D3E" :foreground "#292D3E")
</span>  )

(emacs-solo/avoid-initial-flash-of-light)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Better Window Management handling
</span>(<span class="org-keyword">setq</span> frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '(<span class="org-string">"Emacs"</span>))

(<span class="org-keyword">setq</span> inhibit-compacting-font-caches t)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Disables unused UI Elements
</span>(menu-bar-mode 0)
(scroll-bar-mode 0)
(tool-bar-mode 0)
(tooltip-mode 0)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Resizing the Emacs frame can be a terribly expensive part of changing the
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">font. By inhibiting this, we easily halve startup times with fonts that are
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">larger than the system default.
</span>(<span class="org-keyword">setq</span> frame-inhibit-implied-resize t
        frame-resize-pixelwise t)

(<span class="org-keyword">provide</span> '<span class="org-constant">early-init</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">early-init.el ends here
</span>
</pre>
</div>
</div>
</div>
