content/emacs-configs.org
* Theme

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/theme-conf.el
  ;;; theme-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (use-package doom-themes
    :config
    (if (daemonp)
  	  (add-hook 'server-after-make-frame-hook (lambda () (load-theme 'doom-tokyo-night t)))
  	(load-theme 'doom-tokyo-night t)))

  (use-package doom-modeline
    :init
    (setq mode-line-right-align-edge 'right-fringe) ;; or 'right-margin
    :custom
    (doom-modeline-height 40)
    (doom-modeline-bar-width 8)
    (doom-modeline-check-icon t)
    (doom-modeline-check-simple-format t)
    (doom-modeline-checker-simple-format t)
    (doom-modeline-hud t)
    (doom-modeline-window-width-limit nil)
    (doom-modeline-spc-face-overrides t)
    (doom-modeline-vcs-max-length 12)
    (doom-modeline-checker-simple-format nil)
    :config
    (if (daemonp)
  	  (add-hook 'server-after-make-frame-hook (lambda () (doom-modeline-mode 1)))
  	(doom-modeline-mode 1)))

  (use-package all-the-icons)
  (use-package all-the-icons-dired
    :config
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))

  (use-package beacon
    :config
    (beacon-mode 1))

  (provide 'theme-conf)
  ;;; theme-conf.el ends here
#+end_src

* Window

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/window-conf.el
  ;;; window-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (use-package window
    :ensure nil
    :custom
    (display-buffer-alist
     '(
  	 ;; ("\\*.*e?shell\\*"
  	 ;;  (display-buffer-in-side-window)
  	 ;;  (window-height . 0.25)
  	 ;;  (side . bottom)
  	 ;;  (slot . -1))
  	 ("\\*\\(Backtrace\\|Warnings\\|Compile-Log\\|Messages\\|Bookmark List\\|Occur\\|eldoc\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-height . 0.25)
  	  (side . bottom)
  	  (slot . 0))
  	 ("\\*\\([Hh]elp\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-width . 75)
  	  (side . right)
  	  (slot . 0))
  	 ("\\*\\(Ibuffer\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-width . 100)
  	  (side . right)
  	  (slot . 1))
  	 ("\\*\\(Flymake diagnostics\\|xref\\|Completions\\)"
  	  (display-buffer-in-side-window)
  	  (window-height . 0.25)
  	  (side . bottom)
  	  (slot . 1))
  	 ("\\*\\(grep\\|find\\)\\*"
  	  (display-buffer-in-side-window)
  	  (window-height . 0.25)
  	  (side . bottom)
  	  (slot . 2))
  	 )))
  (provide 'window-conf)
  ;;; window-conf.el ends here
#+end_src

