emacs-configs.html

<div id="outline-container-org4d476e5" class="outline-2">
<h2 id="org4d476e5"><span class="section-number-2">3.</span> Theme</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">theme-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">use-package</span> doom-themes
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">if</span> (daemonp)
        (add-hook 'server-after-make-frame-hook (<span class="org-keyword">lambda</span> () (load-theme 'doom-tokyo-night t)))
      (load-theme 'doom-tokyo-night t)))

(<span class="org-keyword">use-package</span> doom-modeline
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> mode-line-right-align-edge 'right-fringe) <span class="org-comment-delimiter">;; </span><span class="org-comment">or 'right-margin
</span>  <span class="org-builtin">:custom</span>
  (doom-modeline-height 40)
  (doom-modeline-bar-width 8)
  (doom-modeline-check-icon t)
  (doom-modeline-check-simple-format t)
  (doom-modeline-checker-simple-format t)
  (doom-modeline-hud t)
  (doom-modeline-window-width-limit nil)
  (doom-modeline-spc-face-overrides t)
  (doom-modeline-vcs-max-length 12)
  (doom-modeline-checker-simple-format nil)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">if</span> (daemonp)
        (add-hook 'server-after-make-frame-hook (<span class="org-keyword">lambda</span> () (doom-modeline-mode 1)))
      (doom-modeline-mode 1)))

(<span class="org-keyword">use-package</span> all-the-icons)
(<span class="org-keyword">use-package</span> all-the-icons-dired
  <span class="org-builtin">:config</span>
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))

(<span class="org-keyword">use-package</span> beacon
  <span class="org-builtin">:config</span>
  (beacon-mode 1))

(<span class="org-keyword">provide</span> '<span class="org-constant">theme-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">theme-conf.el ends here</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgde03f9b" class="outline-2">
<h2 id="orgde03f9b"><span class="section-number-2">4.</span> Window</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">window-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">use-package</span> window
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:custom</span>
  (display-buffer-alist
   '(
       <span class="org-comment-delimiter">;; </span><span class="org-comment">("\\*.*e?shell\\*"
</span>       <span class="org-comment-delimiter">;;  </span><span class="org-comment">(display-buffer-in-side-window)
</span>       <span class="org-comment-delimiter">;;  </span><span class="org-comment">(window-height . 0.25)
</span>       <span class="org-comment-delimiter">;;  </span><span class="org-comment">(side . bottom)
</span>       <span class="org-comment-delimiter">;;  </span><span class="org-comment">(slot . -1))
</span>       (<span class="org-string">"\\*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">Backtrace</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">Warnings</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">Compile-Log</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">Messages</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">Bookmark List</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">Occur</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">eldoc</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\*"</span>
        (display-buffer-in-side-window)
        (window-height . 0.25)
        (side . bottom)
        (slot . 0))
       (<span class="org-string">"\\*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[Hh]elp</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\*"</span>
        (display-buffer-in-side-window)
        (window-width . 75)
        (side . right)
        (slot . 0))
       (<span class="org-string">"\\*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">Ibuffer</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\*"</span>
        (display-buffer-in-side-window)
        (window-width . 100)
        (side . right)
        (slot . 1))
       (<span class="org-string">"\\*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">Flymake diagnostics</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">xref</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">Completions</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span>
        (display-buffer-in-side-window)
        (window-height . 0.25)
        (side . bottom)
        (slot . 1))
       (<span class="org-string">"\\*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">grep</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">find</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\*"</span>
        (display-buffer-in-side-window)
        (window-height . 0.25)
        (side . bottom)
        (slot . 2))
       )))
(<span class="org-keyword">provide</span> '<span class="org-constant">window-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">window-conf.el ends here</span>
</pre>
</div>
</div>
</div>
