content/emacs-configs.org
* Completion

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/completion-conf.el
  ;;; completion-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (use-package vertico
    :init
    (vertico-mode))

  (use-package savehist
    :init
    (savehist-mode))

  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))

  (use-package marginalia
    :ensure t
    :diminish
    :config
    (marginalia-mode t))

  (use-package consult
    :ensure t
    :bind
    ;; C-x bindings
    ("C-x C-r" . consult-recent-file)
    ("C-x b" . consult-buffer)
    ("C-x 4 b" . consult-buffer-other-window)
    ("C-x 5 b" . consult-buffer-other-frame)
    ("C-x t b" . consult-buffer-other-tab)
    ("C-x r b" . consult-bookmark)
    ("C-x p b" . consult-project-buffer)
    ;; Custom M-# bindings for fast register access
    ("M-#" . consult-register-load)
    ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
    ("C-M-#" . consult-register)
    ("M-y" . consult-yank-pop)
    ;; M-g bindings
    ("M-g M-g" . consult-goto-line)
    ;; C-c s bindings in `search-map'
    ("C-c s e" . consult-complie-error)
    ("C-c s f" . consult-flymake)
    ("C-c s o" . consult-outline)
    ("C-c s m" . consult-mark)
    ("C-c s M" . consult-global-mark)
    ("C-c s i" . consult-imenu)
    ("C-c s I" . consult-imenu-multi)
    ("C-c s d" . consult-find)                  ;; Alternative: consult-fd
    ("C-c s c" . consult-locate)
    ("C-c s g" . consult-grep)
    ("C-c s v" . consult-git-grep)
    ("C-c s r" . consult-ripgrep)
    ("C-c s l" . consult-line)
    ("C-c s L" . consult-line-multi)
    ("C-c s k" . consult-keep-lines)
    ("C-c s u" . consult-focus-lines)
    ("C-c s h" . consult-org-heading))

  ;; (use-package corfu
  ;;   ;; Optional customizations
  ;;   :custom
  ;;   (corfu-cycle t)                   ;; Enable cycling for `corfu-next/previous'
  ;;   (corfu-auto t)                    ;; Enable auto completion
  ;;   (corfu-auto-delay 0.1)
  ;;   (corfu-auto-prefix 4)             ;; Minimum prefix length for auto completion
  ;;   ;; (corfu-separator ?\s)          ;; Orderless field separator
  ;;   ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;;   ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;;   ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  ;;   ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;;   ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  ;;   ;; (corfu-scroll-margin 5)        ;; Use scroll margin
  ;;   ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
  ;;   :hook ((prog-mode . corfu-mode))
  ;;   :config
  ;;   (keymap-set corfu-map "RET" #'corfu-send))

  (provide 'completion-conf)
  ;;; completion-conf.el ends here
#+end_src

* Dired

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/dired-conf.el
  ;;; dired-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (use-package dired
    :ensure nil
    :custom
    (dired-listing-switches "-ahl"))
  (use-package dired-filter)
  (use-package dired-subtree
    :bind (:map dired-mode-map ("C-," . dired-subtree-toggle)))


  (provide 'dired-conf)
  ;;; dired-conf.el ends here
#+end_src

