emacs-configs.html

<div id="outline-container-orgec4fb25" class="outline-2">
<h2 id="orgec4fb25"><span class="section-number-2">5.</span> Completion</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">completion-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">use-package</span> vertico
  <span class="org-builtin">:init</span>
  (vertico-mode))

(<span class="org-keyword">use-package</span> savehist
  <span class="org-builtin">:init</span>
  (savehist-mode))

(<span class="org-keyword">use-package</span> orderless
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:custom</span>
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

(<span class="org-keyword">use-package</span> marginalia
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span>
  <span class="org-builtin">:config</span>
  (marginalia-mode t))

(<span class="org-keyword">use-package</span> consult
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:bind</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">C-x bindings
</span>  (<span class="org-string">"C-x C-r"</span> . consult-recent-file)
  (<span class="org-string">"C-x b"</span> . consult-buffer)
  (<span class="org-string">"C-x 4 b"</span> . consult-buffer-other-window)
  (<span class="org-string">"C-x 5 b"</span> . consult-buffer-other-frame)
  (<span class="org-string">"C-x t b"</span> . consult-buffer-other-tab)
  (<span class="org-string">"C-x r b"</span> . consult-bookmark)
  (<span class="org-string">"C-x p b"</span> . consult-project-buffer)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Custom M-# bindings for fast register access
</span>  (<span class="org-string">"M-#"</span> . consult-register-load)
  (<span class="org-string">"M-'"</span> . consult-register-store)          <span class="org-comment-delimiter">;; </span><span class="org-comment">orig. abbrev-prefix-mark (unrelated)
</span>  (<span class="org-string">"C-M-#"</span> . consult-register)
  (<span class="org-string">"M-y"</span> . consult-yank-pop)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">M-g bindings
</span>  (<span class="org-string">"M-g M-g"</span> . consult-goto-line)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">C-c s bindings in `</span><span class="org-comment"><span class="org-constant">search-map</span></span><span class="org-comment">'
</span>  (<span class="org-string">"C-c s e"</span> . consult-complie-error)
  (<span class="org-string">"C-c s f"</span> . consult-flymake)
  (<span class="org-string">"C-c s o"</span> . consult-outline)
  (<span class="org-string">"C-c s m"</span> . consult-mark)
  (<span class="org-string">"C-c s M"</span> . consult-global-mark)
  (<span class="org-string">"C-c s i"</span> . consult-imenu)
  (<span class="org-string">"C-c s I"</span> . consult-imenu-multi)
  (<span class="org-string">"C-c s d"</span> . consult-find)                  <span class="org-comment-delimiter">;; </span><span class="org-comment">Alternative: consult-fd
</span>  (<span class="org-string">"C-c s c"</span> . consult-locate)
  (<span class="org-string">"C-c s g"</span> . consult-grep)
  (<span class="org-string">"C-c s v"</span> . consult-git-grep)
  (<span class="org-string">"C-c s r"</span> . consult-ripgrep)
  (<span class="org-string">"C-c s l"</span> . consult-line)
  (<span class="org-string">"C-c s L"</span> . consult-line-multi)
  (<span class="org-string">"C-c s k"</span> . consult-keep-lines)
  (<span class="org-string">"C-c s u"</span> . consult-focus-lines)
  (<span class="org-string">"C-c s h"</span> . consult-org-heading))

<span class="org-comment-delimiter">;; </span><span class="org-comment">(use-package corfu
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; Optional customizations
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:custom
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(corfu-cycle t)                   ;; Enable cycling for `</span><span class="org-comment"><span class="org-constant">corfu-next/previous</span></span><span class="org-comment">'
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(corfu-auto t)                    ;; Enable auto completion
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(corfu-auto-delay 0.1)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(corfu-auto-prefix 4)             ;; Minimum prefix length for auto completion
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (corfu-separator ?\s)          ;; Orderless field separator
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (corfu-preview-current nil)    ;; Disable current candidate preview
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (corfu-preselect 'prompt)      ;; Preselect the prompt
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (corfu-scroll-margin 5)        ;; Use scroll margin
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; Enable Corfu only for certain modes. See also `</span><span class="org-comment"><span class="org-constant">global-corfu-modes</span></span><span class="org-comment">'.
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:hook ((prog-mode . corfu-mode))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:config
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(keymap-set corfu-map "RET" #'corfu-send))
</span>
(<span class="org-keyword">provide</span> '<span class="org-constant">completion-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">completion-conf.el ends here</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f7aaa0" class="outline-2">
<h2 id="org8f7aaa0"><span class="section-number-2">6.</span> Dired</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">dired-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">use-package</span> dired
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:custom</span>
  (dired-listing-switches <span class="org-string">"-ahl"</span>))
(<span class="org-keyword">use-package</span> dired-filter)
(<span class="org-keyword">use-package</span> dired-subtree
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> dired-mode-map (<span class="org-string">"C-,"</span> . dired-subtree-toggle)))


(<span class="org-keyword">provide</span> '<span class="org-constant">dired-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">dired-conf.el ends here</span>
</pre>
</div>
</div>
</div>
