content/emacs-configs.org
* Note

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/note-conf.el
  ;;; note-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (use-package org-contrib)
  (use-package ob-typescript)
  (use-package ob-powershell)
  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :custom
    (org-agenda-start-with-log-mode t)
    (org-catch-invisible-edits 'show)
    (org-edit-timestamp-down-means-later t)
    (org-export-coding-system 'utf-8)
    (org-export-kill-product-buffer-when-displayed t)
    (org-fast-tag-selection-single-key 'expert)
    (org-hide-emphasis-markers t)
    (org-html-validation-link nil)
    (org-image-actual-width '(450))
    (org-log-done 'time)
    (org-log-into-drawer t)
    (org-pretty-entities nil)
    (org-startup-indented nil)
    (org-startup-with-inline-images t)
    (org-tags-column 80)
    (org-src-window-setup 'current-window)
    :config
    (require 'org-tempo)
    (require 'ob-js)
    (require 'ob-typescript)
    (require 'ob-ruby)
    (add-to-list 'org-structure-template-alist '("txt"  . "src text"))
    (add-to-list 'org-structure-template-alist '("sh"   . "src shell"))
    (add-to-list 'org-structure-template-alist '("zsh"  . "src zsh"))
    (add-to-list 'org-structure-template-alist '("bash" . "src bash"))
    (add-to-list 'org-structure-template-alist '("posh" . "src powershell"))
    (add-to-list 'org-structure-template-alist '("el"   . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py"   . "src python"))
    (add-to-list 'org-structure-template-alist '("js"   . "src js"))
    (add-to-list 'org-structure-template-alist '("ts"   . "src typescript"))
    (add-to-list 'org-structure-template-alist '("java" . "src java"))
    (add-to-list 'org-structure-template-alist '("scm"  . "src scheme"))
    (add-to-list 'org-structure-template-alist '("sql"  . "src sql"))
    (add-to-list 'org-structure-template-alist '("rust" . "src rust"))
    (add-to-list 'org-structure-template-alist '("rb"   . "src ruby"))
    (org-babel-do-load-languages
     'org-babel-load-languages
     (seq-filter
  	(lambda (pair)
  	  (locate-library (concat "ob-" (symbol-name (car pair)))))
  	'((dot        . t)
  	  (gnuplot    . t)
  	  (latex      . t)
  	  (python     . t)
  	  (js         . t)
  	  (typescript . t)
  	  (shell      . t)
  	  (zsh        . t)
  	  (bash       . t)
  	  (posh       . t)
  	  (powershell . t)
  	  (scheme     . t)
  	  (sql        . t)
  	  (sqlite     . t)
  	  (ruby       . t))))
    (defun handle-electric-pair-inhibit (c)
  	(if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))
    (defun handle-org-mode-hook()
  	(setq-local electric-pair-inhibit-predicate #'handle-electric-pair-inhibit))
    (add-hook 'org-mode-hook #'handle-org-mode-hook))

  (use-package org-appear
    :hook
    (org-mode . org-appear-mode)
    :custom
    (org-appear-autoemphasis t)
    (org-appear-autolinks t)
    (org-appear-autosubmarkers t)
    (org-appear-autoentities t)
    (org-appear-autokeywords t)
    (org-appear-inside-latex t)
    (org-appear-delay 0.0)
    (org-appear-trigger 'always))

  (use-package markdown-mode
    :custom
    (markdown-split-window-direction 'right))

  (provide 'note-conf)
  ;;; note-conf.el ends here
#+end_src

If want some PDF stuff.

Reference some ideas: [[https://emacselements.com/pdf-tools-settings.html][EmacsElements]]

#+begin_src emacs-lisp :tangle no
  ;;; pdf-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (pdf-tools-install)
  (use-package saveplace-pdf-view)
  (global-goto-address-mode t)
  (provide 'pdf-conf)
  ;;; pdf-conf.el ends here
#+end_src

