emacs-configs.html

<div id="outline-container-org235bda8" class="outline-2">
<h2 id="org235bda8"><span class="section-number-2">7.</span> Note</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">note-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">use-package</span> org-contrib)
(<span class="org-keyword">use-package</span> ob-typescript)
(<span class="org-keyword">use-package</span> ob-powershell)
(<span class="org-keyword">use-package</span> org
  <span class="org-builtin">:pin</span> org
  <span class="org-builtin">:commands</span> (org-capture org-agenda)
  <span class="org-builtin">:custom</span>
  (org-agenda-start-with-log-mode t)
  (org-catch-invisible-edits 'show)
  (org-edit-timestamp-down-means-later t)
  (org-export-coding-system 'utf-8)
  (org-export-kill-product-buffer-when-displayed t)
  (org-fast-tag-selection-single-key 'expert)
  (org-hide-emphasis-markers t)
  (org-html-validation-link nil)
  (org-image-actual-width '(450))
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-pretty-entities nil)
  (org-startup-indented nil)
  (org-startup-with-inline-images t)
  (org-tags-column 80)
  (org-src-window-setup 'current-window)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">require</span> '<span class="org-constant">org-tempo</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-js</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-typescript</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">ob-ruby</span>)
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"txt"</span>  . <span class="org-string">"src text"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"sh"</span>   . <span class="org-string">"src shell"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"zsh"</span>  . <span class="org-string">"src zsh"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"bash"</span> . <span class="org-string">"src bash"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"posh"</span> . <span class="org-string">"src powershell"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"el"</span>   . <span class="org-string">"src emacs-lisp"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"py"</span>   . <span class="org-string">"src python"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"js"</span>   . <span class="org-string">"src js"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"ts"</span>   . <span class="org-string">"src typescript"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"java"</span> . <span class="org-string">"src java"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"scm"</span>  . <span class="org-string">"src scheme"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"sql"</span>  . <span class="org-string">"src sql"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"rust"</span> . <span class="org-string">"src rust"</span>))
  (add-to-list 'org-structure-template-alist '(<span class="org-string">"rb"</span>   . <span class="org-string">"src ruby"</span>))
  (org-babel-do-load-languages
   'org-babel-load-languages
   (seq-filter
      (<span class="org-keyword">lambda</span> (pair)
        (locate-library (concat <span class="org-string">"ob-"</span> (symbol-name (car pair)))))
      '((dot        . t)
        (gnuplot    . t)
        (latex      . t)
        (python     . t)
        (js         . t)
        (typescript . t)
        (shell      . t)
        (zsh        . t)
        (bash       . t)
        (posh       . t)
        (powershell . t)
        (scheme     . t)
        (sql        . t)
        (sqlite     . t)
        (ruby       . t))))
  (<span class="org-keyword">defun</span> <span class="org-function-name">handle-electric-pair-inhibit</span> (c)
      (<span class="org-keyword">if</span> (char-equal c ?&lt;) t (,electric-pair-inhibit-predicate c)))
  (<span class="org-keyword">defun</span> <span class="org-function-name">handle-org-mode-hook</span>()
      (<span class="org-keyword">setq-local</span> electric-pair-inhibit-predicate #'handle-electric-pair-inhibit))
  (add-hook 'org-mode-hook #'handle-org-mode-hook))

(<span class="org-keyword">use-package</span> org-appear
  <span class="org-builtin">:hook</span>
  (org-mode . org-appear-mode)
  <span class="org-builtin">:custom</span>
  (org-appear-autoemphasis t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  (org-appear-autoentities t)
  (org-appear-autokeywords t)
  (org-appear-inside-latex t)
  (org-appear-delay 0.0)
  (org-appear-trigger 'always))

(<span class="org-keyword">use-package</span> markdown-mode
  <span class="org-builtin">:custom</span>
  (markdown-split-window-direction 'right))

(<span class="org-keyword">provide</span> '<span class="org-constant">note-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">note-conf.el ends here</span>
</pre>
</div>

<p>
If want some PDF stuff.
</p>

<p>
Reference some ideas: <a href="https://emacselements.com/pdf-tools-settings.html">EmacsElements</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">pdf-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(pdf-tools-install)
(<span class="org-keyword">use-package</span> saveplace-pdf-view)
(global-goto-address-mode t)
(<span class="org-keyword">provide</span> '<span class="org-constant">pdf-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">pdf-conf.el ends here</span>
</pre>
</div>
</div>
</div>
