content/emacs-configs.org
* Shell

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/shell-conf.el
  ;;; shell-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (when (eq system-type 'gnu/linux)
    (use-package eat
  	:bind (("C-c `" . eat))
  	:hook ((eat-exit . pgm/kill-eat-buffer-on-exit))
  	:config
  	(defun pgm/kill-eat-buffer-on-exit (process)
  	  "Kill the eat buffer when the shell process exits."
  	  (let ((buf (process-buffer process)))
	  (when (buffer-live-p buf)
	    (kill-buffer buf))))))

  ;; Shell
  (use-package shell
    :ensure nil
    :custom
    (comint-prompt-read-only t)
    (comint-process-echoes t))

  ;; Eshell
  (use-package eshell
    :defer t
    :custom
    (eshell-history-size 10000)
    (eshell-buffer-maximum-lines 10000)
    (eshell-hist-ignoredups t)
    (eshell-scroll-to-bottom-on-input 'all)
    (eshell-scroll-to-bottom-on-output t)
    (eshell-error-if-no-glob t)
    (eshell-save-history-on-exit t)
    (eshell-prefer-lisp-functions t)
    (eshell-destroy-buffer-when-process-dies t)
    (eshell-visual-commands '("vi" "screen" "top"  "htop" "btm" "less" "more" "lynx" "ncftp" "pine" "tin" "trn"
			      "elm" "irssi" "nmtui-connect" "nethack" "vim" "alsamixer" "nvim" "w3m"
			      "ncmpcpp" "newsbeuter" "nethack" "mutt" "fzf"))
    :hook
    (eshell-load . eat-eshell-mode)
    (eshell-load . eat-eshell-visual-command-mode))

  (use-package eshell-prompt-extras
    :hook
    (eshell-first-time-mode . pgm/eshell-init)
    :custom
    (eshell-highlight-prompt t)
    (eshell-prompt-function 'epe-theme-lambda)
    :config
    (defun pgm/eshell-init ()
  	(eshell/alias "l" "ls -hl")
  	(eshell/alias "ll" "ls -hl")
  	(eshell/alias "la" "ls -ahl")
  	(eshell/alias "gs" "git status")
  	(eshell/alias "gd" "git diff")
  	(eshell/alias "gl" "git log --oneline")
  	(eshell/alias ".." "cd ..")))

  (provide 'shell-conf)
  ;;; shell-conf.el ends here
#+end_src

