emacs-configs.html

<div id="outline-container-orgf2d5588" class="outline-2">
<h2 id="orgf2d5588"><span class="section-number-2">8.</span> Shell</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">shell-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">when</span> (eq system-type 'gnu/linux)
  (<span class="org-keyword">use-package</span> eat
      <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c `"</span> . eat))
      <span class="org-builtin">:hook</span> ((eat-exit . pgm/kill-eat-buffer-on-exit))
      <span class="org-builtin">:config</span>
      (<span class="org-keyword">defun</span> <span class="org-function-name">pgm/kill-eat-buffer-on-exit</span> (process)
        <span class="org-doc">"Kill the eat buffer when the shell process exits."</span>
        (<span class="org-keyword">let</span> ((buf (process-buffer process)))
        (<span class="org-keyword">when</span> (buffer-live-p buf)
          (kill-buffer buf))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Shell
</span>(<span class="org-keyword">use-package</span> shell
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:custom</span>
  (comint-prompt-read-only t)
  (comint-process-echoes t))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Eshell
</span>(<span class="org-keyword">use-package</span> eshell
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:custom</span>
  (eshell-history-size 10000)
  (eshell-buffer-maximum-lines 10000)
  (eshell-hist-ignoredups t)
  (eshell-scroll-to-bottom-on-input 'all)
  (eshell-scroll-to-bottom-on-output t)
  (eshell-error-if-no-glob t)
  (eshell-save-history-on-exit t)
  (eshell-prefer-lisp-functions t)
  (eshell-destroy-buffer-when-process-dies t)
  (eshell-visual-commands '(<span class="org-string">"vi"</span> <span class="org-string">"screen"</span> <span class="org-string">"top"</span>  <span class="org-string">"htop"</span> <span class="org-string">"btm"</span> <span class="org-string">"less"</span> <span class="org-string">"more"</span> <span class="org-string">"lynx"</span> <span class="org-string">"ncftp"</span> <span class="org-string">"pine"</span> <span class="org-string">"tin"</span> <span class="org-string">"trn"</span>
                            <span class="org-string">"elm"</span> <span class="org-string">"irssi"</span> <span class="org-string">"nmtui-connect"</span> <span class="org-string">"nethack"</span> <span class="org-string">"vim"</span> <span class="org-string">"alsamixer"</span> <span class="org-string">"nvim"</span> <span class="org-string">"w3m"</span>
                            <span class="org-string">"ncmpcpp"</span> <span class="org-string">"newsbeuter"</span> <span class="org-string">"nethack"</span> <span class="org-string">"mutt"</span> <span class="org-string">"fzf"</span>))
  <span class="org-builtin">:hook</span>
  (eshell-load . eat-eshell-mode)
  (eshell-load . eat-eshell-visual-command-mode))

(<span class="org-keyword">use-package</span> eshell-prompt-extras
  <span class="org-builtin">:hook</span>
  (eshell-first-time-mode . pgm/eshell-init)
  <span class="org-builtin">:custom</span>
  (eshell-highlight-prompt t)
  (eshell-prompt-function 'epe-theme-lambda)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">pgm/eshell-init</span> ()
      (eshell/alias <span class="org-string">"l"</span> <span class="org-string">"ls -hl"</span>)
      (eshell/alias <span class="org-string">"ll"</span> <span class="org-string">"ls -hl"</span>)
      (eshell/alias <span class="org-string">"la"</span> <span class="org-string">"ls -ahl"</span>)
      (eshell/alias <span class="org-string">"gs"</span> <span class="org-string">"git status"</span>)
      (eshell/alias <span class="org-string">"gd"</span> <span class="org-string">"git diff"</span>)
      (eshell/alias <span class="org-string">"gl"</span> <span class="org-string">"git log --oneline"</span>)
      (eshell/alias <span class="org-string">".."</span> <span class="org-string">"cd .."</span>)))

(<span class="org-keyword">provide</span> '<span class="org-constant">shell-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">shell-conf.el ends here</span>
</pre>
</div>
</div>
</div>
