content/emacs-configs.org
* Programming

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/prog-conf.el
  ;;; prog-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package company
    :hook
    (prog-mode . company-mode)
    :bind (:map company-mode-map
  		("TAB" . company-indent-or-complete-common)
  		([tab] . company-indent-or-complete-common)
  		:map company-active-map
  		("TAB"       . company-complete-selection)
  		([tab]       . company-complete-selection)
  		("<backtab>" . company-abort)
  		("C-g"       . company-abort)
  		("C-h"       . company-show-doc-buffer))
    :custom
    (company-idle-delay                nil)
    (company-minimum-prefix-length     1)
    (company-require-match-p           'never)
    (company-frontends                 '(company-preview-frontend company-echo-metadata-frontend))
    (company-backends                  '(company-capf))
    (company-tooltip-align-annotations t))

  (use-package lsp-mode
    :hook
    ((java-mode          . lsp)
     (java-ts-mode       . lsp)
     (bash-ts-mode       . lsp)
     (mhtml-mode         . lsp)
     (js-ts-mode         . lsp)
     (json-ts-mode       . lsp)
     (typescript-mode    . lsp)
     (typescript-ts-mode . lsp)
     (python-mode        . lsp)
     (python-ts-mode     . lsp)
     (c-mode             . lsp)
     (c-ts-mode          . lsp)
     (clojure-mode       . lsp)
     (ruby-mode          . lsp-deferred)
     (ruby-ts-mode       . lsp-deferred))
    :custom
    (lsp-keymap-prefix "C-c l")
    (lsp-enable-on-type-formatting nil)
    (lsp-enable-indentation nil)
    (lsp-completion-provider :none)
    ;; https://github.com/sqls-server/sqls?tab=readme-ov-file#installation
    ;; https://github.com/sqls-server/sqls?tab=readme-ov-file#db-configuration
    (lsp-sqls-workspace-config-path "workspace")
    (lsp-sqls-connections nil)
    (lsp-disabled-clients '(rubocop-ls solargraph sorbet-ls))
    (lsp-ruby-use-bundler t)
    :bind
    (:map lsp-mode-map
  	  ("C-c l r" . lsp-rename)))

  (use-package lsp-java
    :after lsp
    :hook
    (java-mode . lsp))

  (use-package compile
    :ensure nil
    ;; :hook
    ;; (;; Not ideal, but I do not want this poluting the modeline
    ;;  (compilation-start . (lambda () (setq compilation-in-progress nil))))
    :custom
    (compilation-always-kill t)
    (compilation-scroll-output t)
    (ansi-color-for-compilation-mode t)
    :config
    (add-hook 'compilation-filter-hook #'ansi-color-compilation-filter))

  (use-package makefile-mode
    :ensure nil
    :mode "\\Makefile.*\\'"
    :defer 't
    :config
    (add-to-list 'treesit-language-source-alist '(make "https://github.com/alemuller/tree-sitter-make")))

  (unless (eq system-type 'windows-nt)
    ;; TODO: finish https://clojure-doc.org/articles/tutorials/introduction/
    (use-package cider
  	:custom
  	(nrepl-use-ssh-fallback-for-remote-hosts t))
    (use-package ejc-sql
  	;; Github: https://github.com/kostafey/ejc-sql?tab=readme-ov-file#mariadbconnection
  	;; M-x ejc-connect
  	;; M-x ejc-quit-connection -> it refreshes the connection
  	:config
  	(load (expand-file-name ".local/ejc-config.el" user-emacs-directory) 'noerror 'nomessage))
    (use-package tree-sitter
  	:config
  	(global-tree-sitter-mode 1))
    (use-package tree-sitter-langs)
    (use-package treesit-auto
  	:config
  	(global-treesit-auto-mode 1)))

  (use-package conf-mode
    :ensure nil
    :mode ("\\.env\\..*\\'" "\\.env\\'")
    :init
    (add-to-list 'auto-mode-alist '("\\.env\\'" . conf-mode)))

  (use-package sql-indent
    :hook
    (sql-mode . sqlind-minor-mode))

  (use-package typescript-mode :defer t)
  (use-package powershell :defer t)
  (use-package scss-mode :defer t)
  (use-package yaml-mode :defer t)

  ;; (use-package python-mode
  ;;   :ensure nil
  ;;   :mode "\\.py\\'"
  ;;   :defer 't
  ;;   ;; :config
  ;;   ;; TODO: python related configs
  ;;   ;; TODO: python-ts-mode crashes when open .py files
  ;;   ;; (add-to-list 'treesit-language-source-alist '(python "https://github.com/tree-sitter/tree-sitter-python" "master" "src"))
  ;;   )

  (use-package magit)

  (use-package project
    :bind
    (("C-x p C" . project-recompile)))

  (use-package smerge-mode
    :ensure nil
    :bind (:map smerge-mode-map
  		("C-c ^ u" . smerge-keep-upper)
  		("C-c ^ l" . smerge-keep-lower)
  		("C-c ^ n" . smerge-next)
  		("C-c ^ p" . smerge-previous)))

  (use-package eldoc
    :ensure nil
    :init
    (global-eldoc-mode))

  (use-package eldoc-box
    :defer t
    :custom
    (eldoc-box-border-width 1)
    (eldoc-box-echo-area-use-multiline-p t)
    (eldoc-box-scrollbar-width 8)
    (eldoc-box-max-lines 10)
    (eldoc-box-use-echo-area nil)
    :bind
    ("C-c h ." . eldoc-box-help-at-point)
    :hook
    (eldoc-mode . eldoc-box-hover-mode))

  (use-package dap-mode
    :after lsp-mode
    ;; :custom
    ;; (dap-auto-configure-features '())
    :bind (:map dap-mode-map
  		("C-c <f9>" . dap-debug)
  		("C-c <f8>" . dap-breakpoint-toggle)
  		("C-c d r"  . dap-debug-restart)
  		("<f7>"     . dap-step-in)
  		("<f10>"    . dap-step-out)
  		("<f8>"     . dap-next)
  		("<f11>"    . dap-previous)
  		("<f9>"     . dap-continue)
  		("C-c d q"  . dap-disconnect)
  		("C-c d e"  . dap-eval)
  		("C-c d v"  . dap-eval-thing-at-point)
  		("C-c d E"  . dap-eval-region))
    :config
    (dap-auto-configure-mode)
    (require 'dap-java)
    (require 'dap-lldb)
    (require 'dap-cpptools)
    (require 'dap-gdb)
    (require 'dap-gdb-lldb)

    ;; (require 'dap-cpptools)
    ;; (with-eval-after-load 'dap-mode
    ;;	(dap-register-debug-template
    ;;	 "LLDB::Run"
    ;;	 (list :type "lldb-vscode"
    ;;		   :cwd  (expand-file-name (project-root (project-current)))
    ;;		   :request "launch"
    ;;		   :program (expand-file-name "bin/win32_game.exe" (project-root (project-current)))
    ;;		   :name "LLDB::Run")))
    ;; (setq dap-lldb-debug-program '("C:/Users/douzone/.emacs.d/.extension/vscode/vadimcn.vscode-lldb/codelldb-win32-x64/extension/adapter/codelldb.exe"))
    )

  ;; (use-package evil
  ;;   :init
  ;;   (setq evil-disable-insert-state-bindings t)
  ;;   (setq evil-move-beyond-eol t)
  ;;   ;; :hook (prog-mode . evil-local-mode)
  ;;   )

  ;;; EGLOT
  ;; pip install python-lsp-server flake8
  ;; npm install -g typescript teypscript-language-server
  ;; npm install -g vscode-langservers-extracted
  ;; (use-package eglot
  ;;   :ensure nil
  ;;   :custom
  ;;   (eglot-autoshutdown t)
  ;;   (eglot-events-buffer-size 0)
  ;;   (eglot-events-buffer-config '(:size 0 :format full))
  ;;   (eglot-prefer-plaintext t)
  ;;   (jsonrpc-event-hook nil)
  ;;   (eglot-code-action-indications nil) ;; Emacs 31 -- annoying as hell
  ;;   :init
  ;;   (fset #'jsonrpc--log-event #'ignore)
  ;;   :hook
  ;;   ((mhtml-mode
  ;;     css-mode
  ;;     ;; css-ts-mode
  ;;     ;; js-ts-mode
  ;;     ;; typescript-ts-mode
  ;;	js-mode
  ;;	typescript-mode
  ;;	python-mode
  ;;     java-mode)
  ;;    . eglot-ensure)
  ;;   :bind (:map
  ;;		 eglot-mode-map
  ;;		 ("C-c l a" . eglot-code-actions)
  ;;		 ("C-c l o" . eglot-code-actions-organize-imports)
  ;;		 ("C-c l r" . eglot-rename)
  ;;		 ("C-c l f" . eglot-format)))

  ;;; EGLOT-JAVA
  ;; (use-package eglot-java
  ;;   :hook
  ;;   ((java-mode java-ts-mode)  . eglot-java-mode)
  ;;   :bind (:map
  ;;		 eglot-java-mode-map
  ;;		 ("C-c l n" . eglot-java-file-new)
  ;;		 ("C-c l x" . eglot-java-run-main)
  ;;		 ("C-c l t" . eglot-java-run-test)
  ;;		 ("C-c l N" . eglot-java-project-new)
  ;;		 ("C-c l T" . eglot-java-project-build-task)
  ;;		 ("C-c l R" . eglot-java-project-build-refresh)))

  (use-package elec-pair
    :ensure nil
    :defer
    :hook
    (after-init-hook . electric-pair-mode))

  (use-package paren
    :ensure nil
    :hook
    (after-init-hook . show-paren-mode)
    :custom
    (show-paren-delay 0)
    (show-paren-style 'mixed)
    (show-paren-context-when-offscreen t))

  (use-package inf-ruby)

  (use-package tagedit
    :hook
    ((mhtml-mode
  	sgml-mode
  	nxml-mode)
     . (lambda ()
  	   (tagedit-add-paredit-like-keybindings)
  	   (tagedit-mode 1))))

  (use-package emmet-mode
    :hook (mhtml-mode sgml-mode nxml-mode))

  (use-package flymake
    :ensure nil
    :defer t
    :hook ((prog-mode . flymake-mode)
  	   (elisp-mode . flymake-mode))
    :bind (:map flymake-mode-map
  		("M-8" . flymake-goto-next-error)
  		("M-7" . flymake-goto-prev-error)
  		("C-c ! n" . flymake-goto-next-error)
  		("C-c ! p" . flymake-goto-prev-error)
  		("C-c ! l" . flymake-show-buffer-diagnostics)
  		("C-c ! t" . toggle-flymake-diagnostics-at-eol))
    :custom
    (flymake-show-diagnostics-at-end-of-line nil)
    ;; (flymake-show-diagnostics-at-end-of-line 'short)
    (flymake-indicator-type 'margins)
    (flymake-margin-indicators-string
     `((error   "!" compilation-error) ;; Alternatives: », E, W, i, !, ?)
  	 (warning "?" compilation-warning)
  	 (note    "i" compilation-info)))
    :config
    ;; Define the toggle function
    (defun toggle-flymake-diagnostics-at-eol ()
  	"Toggle the display of Flymake diagnostics at the end of the line
  and restart Flymake to apply the changes."
  	(interactive)
  	(setq flymake-show-diagnostics-at-end-of-line
  	    (not flymake-show-diagnostics-at-end-of-line))
  	(flymake-mode -1) ;; Disable Flymake
  	(flymake-mode 1)  ;; Re-enable Flymake
  	(message "Flymake diagnostics at end of line: %s"
  	       (if flymake-show-diagnostics-at-end-of-line
  		   "Enabled" "Disabled"))))

  (use-package diff-mode
    :ensure nil
    :defer t
    :config
    (setq diff-default-read-only t)
    (setq diff-advance-after-apply-hunk t)
    (setq diff-update-on-the-fly t)
    (setq diff-font-lock-syntax 'hunk-also)
    (setq diff-font-lock-prettify nil))

  (use-package copilot
    ;; :hook (prog-mode . copilot-mode)
    :bind (:map copilot-completion-map
  		("C-c C-n"     . copilot-next-completion)
  		("C-c n"       . copilot-next-completion)
  		("C-c C-p"     . copilot-previous-completion)
  		("C-c p"       . copilot-previous-completion)
  		("C-c c f"     . copilot-accept-completion-by-word)
  		("C-c c e"     . copilot-accept-completion-by-line)
  		("C-c <SPC>"   . copilot-accept-completion)
  		("C-c c <SPC>" . copilot-accept-completion)
  		("C-c C-<SPC>" . copilot-accept-completion)
  		("C-c c t"     . copilot-toggle-auto-complete)))

  (use-package ediff
    :ensure nil
    :commands (ediff-buffers ediff-files ediff-buffers3 ediff-files3)
    :init
    (setq ediff-split-window-function 'split-window-horizontally)
    (setq ediff-window-setup-function 'ediff-setup-windows-plain)
    :config
    (setq ediff-keep-variants nil)
    (setq ediff-make-buffers-readonly-at-startup nil)
    (setq ediff-merge-revisions-with-ancestor t)
    (setq ediff-show-clashes-only t))

  (use-package yasnippet
    :hook
    (prog-mode . yas-minor-mode))

  ;; (use-package smart-hungry-delete
  ;;   :ensure t
  ;;   :bind (([remap backward-delete-char-untabify] . smart-hungry-delete-backward-char)
  ;;		 ([remap delete-backward-char] . smart-hungry-delete-backward-char)
  ;;		 ([remap delete-char] . smart-hungry-delete-forward-char))
  ;;   :init (smart-hungry-delete-add-default-hooks))

  (use-package whitespace
    :ensure nil
    :defer t
    ;; :hook (before-save . whitespace-cleanup)
    )

  (provide 'prog-conf)
  ;;; prog-conf.el ends here
#+end_src

