emacs-configs.html

<div id="outline-container-org9321940" class="outline-2">
<h2 id="org9321940"><span class="section-number-2">9.</span> Programming</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">prog-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
(<span class="org-keyword">use-package</span> company
  <span class="org-builtin">:hook</span>
  (prog-mode . company-mode)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> company-mode-map
              (<span class="org-string">"TAB"</span> . company-indent-or-complete-common)
              ([tab] . company-indent-or-complete-common)
              <span class="org-builtin">:map</span> company-active-map
              (<span class="org-string">"TAB"</span>       . company-complete-selection)
              ([tab]       . company-complete-selection)
              (<span class="org-string">"&lt;backtab&gt;"</span> . company-abort)
              (<span class="org-string">"C-g"</span>       . company-abort)
              (<span class="org-string">"C-h"</span>       . company-show-doc-buffer))
  <span class="org-builtin">:custom</span>
  (company-idle-delay                nil)
  (company-minimum-prefix-length     1)
  (company-require-match-p           'never)
  (company-frontends                 '(company-preview-frontend company-echo-metadata-frontend))
  (company-backends                  '(company-capf))
  (company-tooltip-align-annotations t))

(<span class="org-keyword">use-package</span> lsp-mode
  <span class="org-builtin">:hook</span>
  ((java-mode          . lsp)
   (java-ts-mode       . lsp)
   (bash-ts-mode       . lsp)
   (mhtml-mode         . lsp)
   (js-ts-mode         . lsp)
   (json-ts-mode       . lsp)
   (typescript-mode    . lsp)
   (typescript-ts-mode . lsp)
   (python-mode        . lsp)
   (python-ts-mode     . lsp)
   (c-mode             . lsp)
   (c-ts-mode          . lsp)
   (clojure-mode       . lsp)
   (ruby-mode          . lsp-deferred)
   (ruby-ts-mode       . lsp-deferred))
  <span class="org-builtin">:custom</span>
  (lsp-keymap-prefix <span class="org-string">"C-c l"</span>)
  (lsp-enable-on-type-formatting nil)
  (lsp-enable-indentation nil)
  (lsp-completion-provider <span class="org-builtin">:none</span>)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">https://github.com/sqls-server/sqls?tab=readme-ov-file#installation
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">https://github.com/sqls-server/sqls?tab=readme-ov-file#db-configuration
</span>  (lsp-sqls-workspace-config-path <span class="org-string">"workspace"</span>)
  (lsp-sqls-connections nil)
  (lsp-disabled-clients '(rubocop-ls solargraph sorbet-ls))
  (lsp-ruby-use-bundler t)
  <span class="org-builtin">:bind</span>
  (<span class="org-builtin">:map</span> lsp-mode-map
        (<span class="org-string">"C-c l r"</span> . lsp-rename)))

(<span class="org-keyword">use-package</span> lsp-java
  <span class="org-builtin">:after</span> lsp
  <span class="org-builtin">:hook</span>
  (java-mode . lsp))

(<span class="org-keyword">use-package</span> compile
  <span class="org-builtin">:ensure</span> nil
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:hook
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(;; Not ideal, but I do not want this poluting the modeline
</span>  <span class="org-comment-delimiter">;;  </span><span class="org-comment">(compilation-start . (lambda () (setq compilation-in-progress nil))))
</span>  <span class="org-builtin">:custom</span>
  (compilation-always-kill t)
  (compilation-scroll-output t)
  (ansi-color-for-compilation-mode t)
  <span class="org-builtin">:config</span>
  (add-hook 'compilation-filter-hook #'ansi-color-compilation-filter))

(<span class="org-keyword">use-package</span> makefile-mode
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:mode</span> <span class="org-string">"\\Makefile.*\\'"</span>
  <span class="org-builtin">:defer</span> 't
  <span class="org-builtin">:config</span>
  (add-to-list 'treesit-language-source-alist '(make <span class="org-string">"https://github.com/alemuller/tree-sitter-make"</span>)))

(<span class="org-keyword">unless</span> (eq system-type 'windows-nt)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">TODO: finish https://clojure-doc.org/articles/tutorials/introduction/
</span>  (<span class="org-keyword">use-package</span> cider
      <span class="org-builtin">:custom</span>
      (nrepl-use-ssh-fallback-for-remote-hosts t))
  (<span class="org-keyword">use-package</span> ejc-sql
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Github: https://github.com/kostafey/ejc-sql?tab=readme-ov-file#mariadbconnection
</span>      <span class="org-comment-delimiter">;; </span><span class="org-comment">M-x ejc-connect
</span>      <span class="org-comment-delimiter">;; </span><span class="org-comment">M-x ejc-quit-connection -&gt; it refreshes the connection
</span>      <span class="org-builtin">:config</span>
      (load (expand-file-name <span class="org-string">".local/ejc-config.el"</span> user-emacs-directory) 'noerror 'nomessage))
  (<span class="org-keyword">use-package</span> tree-sitter
      <span class="org-builtin">:config</span>
      (global-tree-sitter-mode 1))
  (<span class="org-keyword">use-package</span> tree-sitter-langs)
  (<span class="org-keyword">use-package</span> treesit-auto
      <span class="org-builtin">:config</span>
      (global-treesit-auto-mode 1)))

(<span class="org-keyword">use-package</span> conf-mode
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:mode</span> (<span class="org-string">"\\.env\\..*\\'"</span> <span class="org-string">"\\.env\\'"</span>)
  <span class="org-builtin">:init</span>
  (add-to-list 'auto-mode-alist '(<span class="org-string">"\\.env\\'"</span> . conf-mode)))

(<span class="org-keyword">use-package</span> sql-indent
  <span class="org-builtin">:hook</span>
  (sql-mode . sqlind-minor-mode))

(<span class="org-keyword">use-package</span> typescript-mode <span class="org-builtin">:defer</span> t)
(<span class="org-keyword">use-package</span> powershell <span class="org-builtin">:defer</span> t)
(<span class="org-keyword">use-package</span> scss-mode <span class="org-builtin">:defer</span> t)
(<span class="org-keyword">use-package</span> yaml-mode <span class="org-builtin">:defer</span> t)

<span class="org-comment-delimiter">;; </span><span class="org-comment">(use-package python-mode
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:ensure nil
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:mode "\\.py\\'"
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:defer 't
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; :config
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; TODO: python related configs
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; TODO: python-ts-mode crashes when open .py files
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; (add-to-list 'treesit-language-source-alist '(python "https://github.com/tree-sitter/tree-sitter-python" "master" "src"))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">)
</span>
(<span class="org-keyword">use-package</span> magit)

(<span class="org-keyword">use-package</span> project
  <span class="org-builtin">:bind</span>
  ((<span class="org-string">"C-x p C"</span> . project-recompile)))

(<span class="org-keyword">use-package</span> smerge-mode
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> smerge-mode-map
              (<span class="org-string">"C-c ^ u"</span> . smerge-keep-upper)
              (<span class="org-string">"C-c ^ l"</span> . smerge-keep-lower)
              (<span class="org-string">"C-c ^ n"</span> . smerge-next)
              (<span class="org-string">"C-c ^ p"</span> . smerge-previous)))

(<span class="org-keyword">use-package</span> eldoc
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:init</span>
  (global-eldoc-mode))

(<span class="org-keyword">use-package</span> eldoc-box
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:custom</span>
  (eldoc-box-border-width 1)
  (eldoc-box-echo-area-use-multiline-p t)
  (eldoc-box-scrollbar-width 8)
  (eldoc-box-max-lines 10)
  (eldoc-box-use-echo-area nil)
  <span class="org-builtin">:bind</span>
  (<span class="org-string">"C-c h ."</span> . eldoc-box-help-at-point)
  <span class="org-builtin">:hook</span>
  (eldoc-mode . eldoc-box-hover-mode))

(<span class="org-keyword">use-package</span> dap-mode
  <span class="org-builtin">:after</span> lsp-mode
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:custom
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(dap-auto-configure-features '())
</span>  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> dap-mode-map
              (<span class="org-string">"C-c &lt;f9&gt;"</span> . dap-debug)
              (<span class="org-string">"C-c &lt;f8&gt;"</span> . dap-breakpoint-toggle)
              (<span class="org-string">"C-c d r"</span>  . dap-debug-restart)
              (<span class="org-string">"&lt;f7&gt;"</span>     . dap-step-in)
              (<span class="org-string">"&lt;f10&gt;"</span>    . dap-step-out)
              (<span class="org-string">"&lt;f8&gt;"</span>     . dap-next)
              (<span class="org-string">"&lt;f11&gt;"</span>    . dap-previous)
              (<span class="org-string">"&lt;f9&gt;"</span>     . dap-continue)
              (<span class="org-string">"C-c d q"</span>  . dap-disconnect)
              (<span class="org-string">"C-c d e"</span>  . dap-eval)
              (<span class="org-string">"C-c d v"</span>  . dap-eval-thing-at-point)
              (<span class="org-string">"C-c d E"</span>  . dap-eval-region))
  <span class="org-builtin">:config</span>
  (dap-auto-configure-mode)
  (<span class="org-keyword">require</span> '<span class="org-constant">dap-java</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">dap-lldb</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">dap-cpptools</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">dap-gdb</span>)
  (<span class="org-keyword">require</span> '<span class="org-constant">dap-gdb-lldb</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'dap-cpptools)
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(with-eval-after-load 'dap-mode
</span>  <span class="org-comment-delimiter">;;</span><span class="org-comment">    (dap-register-debug-template
</span>  <span class="org-comment-delimiter">;;</span><span class="org-comment">     "LLDB::Run"
</span>  <span class="org-comment-delimiter">;;</span><span class="org-comment">     (list :type "lldb-vscode"
</span>  <span class="org-comment-delimiter">;;</span><span class="org-comment">               :cwd  (expand-file-name (project-root (project-current)))
</span>  <span class="org-comment-delimiter">;;</span><span class="org-comment">               :request "launch"
</span>  <span class="org-comment-delimiter">;;</span><span class="org-comment">               :program (expand-file-name "bin/win32_game.exe" (project-root (project-current)))
</span>  <span class="org-comment-delimiter">;;</span><span class="org-comment">               :name "LLDB::Run")))
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq dap-lldb-debug-program '("C:/Users/douzone/.emacs.d/.extension/vscode/vadimcn.vscode-lldb/codelldb-win32-x64/extension/adapter/codelldb.exe"))
</span>  )

<span class="org-comment-delimiter">;; </span><span class="org-comment">(use-package evil
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:init
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(setq evil-disable-insert-state-bindings t)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(setq evil-move-beyond-eol t)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; :hook (prog-mode . evil-local-mode)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">)
</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">EGLOT
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">pip install python-lsp-server flake8
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">npm install -g typescript teypscript-language-server
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">npm install -g vscode-langservers-extracted
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(use-package eglot
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:ensure nil
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:custom
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(eglot-autoshutdown t)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(eglot-events-buffer-size 0)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(eglot-events-buffer-config '(:size 0 :format full))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(eglot-prefer-plaintext t)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(jsonrpc-event-hook nil)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(eglot-code-action-indications nil) ;; Emacs 31 -- annoying as hell
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:init
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">(fset #'jsonrpc--log-event #'ignore)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:hook
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">((mhtml-mode
</span><span class="org-comment-delimiter">;;     </span><span class="org-comment">css-mode
</span><span class="org-comment-delimiter">;;     </span><span class="org-comment">;; css-ts-mode
</span><span class="org-comment-delimiter">;;     </span><span class="org-comment">;; js-ts-mode
</span><span class="org-comment-delimiter">;;     </span><span class="org-comment">;; typescript-ts-mode
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">      js-mode
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">      typescript-mode
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">      python-mode
</span><span class="org-comment-delimiter">;;     </span><span class="org-comment">java-mode)
</span><span class="org-comment-delimiter">;;    </span><span class="org-comment">. eglot-ensure)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:bind (:map
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               eglot-mode-map
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l a" . eglot-code-actions)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l o" . eglot-code-actions-organize-imports)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l r" . eglot-rename)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l f" . eglot-format)))
</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">EGLOT-JAVA
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(use-package eglot-java
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:hook
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">((java-mode java-ts-mode)  . eglot-java-mode)
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:bind (:map
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               eglot-java-mode-map
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l n" . eglot-java-file-new)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l x" . eglot-java-run-main)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l t" . eglot-java-run-test)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l N" . eglot-java-project-new)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l T" . eglot-java-project-build-task)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ("C-c l R" . eglot-java-project-build-refresh)))
</span>
(<span class="org-keyword">use-package</span> elec-pair
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:defer</span>
  <span class="org-builtin">:hook</span>
  (after-init-hook . electric-pair-mode))

(<span class="org-keyword">use-package</span> paren
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:hook</span>
  (after-init-hook . show-paren-mode)
  <span class="org-builtin">:custom</span>
  (show-paren-delay 0)
  (show-paren-style 'mixed)
  (show-paren-context-when-offscreen t))

(<span class="org-keyword">use-package</span> inf-ruby)

(<span class="org-keyword">use-package</span> tagedit
  <span class="org-builtin">:hook</span>
  ((mhtml-mode
      sgml-mode
      nxml-mode)
   . (<span class="org-keyword">lambda</span> ()
         (tagedit-add-paredit-like-keybindings)
         (tagedit-mode 1))))

(<span class="org-keyword">use-package</span> emmet-mode
  <span class="org-builtin">:hook</span> (mhtml-mode sgml-mode nxml-mode))

(<span class="org-keyword">use-package</span> flymake
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:hook</span> ((prog-mode . flymake-mode)
         (elisp-mode . flymake-mode))
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> flymake-mode-map
              (<span class="org-string">"M-8"</span> . flymake-goto-next-error)
              (<span class="org-string">"M-7"</span> . flymake-goto-prev-error)
              (<span class="org-string">"C-c ! n"</span> . flymake-goto-next-error)
              (<span class="org-string">"C-c ! p"</span> . flymake-goto-prev-error)
              (<span class="org-string">"C-c ! l"</span> . flymake-show-buffer-diagnostics)
              (<span class="org-string">"C-c ! t"</span> . toggle-flymake-diagnostics-at-eol))
  <span class="org-builtin">:custom</span>
  (flymake-show-diagnostics-at-end-of-line nil)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(flymake-show-diagnostics-at-end-of-line 'short)
</span>  (flymake-indicator-type 'margins)
  (flymake-margin-indicators-string
   `((<span class="org-warning">error</span>   <span class="org-string">"!"</span> compilation-error) <span class="org-comment-delimiter">;; </span><span class="org-comment">Alternatives: &#187;, E, W, i, !, ?)
</span>       (warning <span class="org-string">"?"</span> compilation-warning)
       (note    <span class="org-string">"i"</span> compilation-info)))
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Define the toggle function
</span>  (<span class="org-keyword">defun</span> <span class="org-function-name">toggle-flymake-diagnostics-at-eol</span> ()
      <span class="org-doc">"Toggle the display of Flymake diagnostics at the end of the line
and restart Flymake to apply the changes."</span>
      (<span class="org-keyword">interactive</span>)
      (<span class="org-keyword">setq</span> flymake-show-diagnostics-at-end-of-line
          (not flymake-show-diagnostics-at-end-of-line))
      (flymake-mode -1) <span class="org-comment-delimiter">;; </span><span class="org-comment">Disable Flymake
</span>      (flymake-mode 1)  <span class="org-comment-delimiter">;; </span><span class="org-comment">Re-enable Flymake
</span>      (message <span class="org-string">"Flymake diagnostics at end of line: %s"</span>
             (<span class="org-keyword">if</span> flymake-show-diagnostics-at-end-of-line
                 <span class="org-string">"Enabled"</span> <span class="org-string">"Disabled"</span>))))

(<span class="org-keyword">use-package</span> diff-mode
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> diff-default-read-only t)
  (<span class="org-keyword">setq</span> diff-advance-after-apply-hunk t)
  (<span class="org-keyword">setq</span> diff-update-on-the-fly t)
  (<span class="org-keyword">setq</span> diff-font-lock-syntax 'hunk-also)
  (<span class="org-keyword">setq</span> diff-font-lock-prettify nil))

(<span class="org-keyword">use-package</span> copilot
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:hook (prog-mode . copilot-mode)
</span>  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> copilot-completion-map
              (<span class="org-string">"C-c C-n"</span>     . copilot-next-completion)
              (<span class="org-string">"C-c n"</span>       . copilot-next-completion)
              (<span class="org-string">"C-c C-p"</span>     . copilot-previous-completion)
              (<span class="org-string">"C-c p"</span>       . copilot-previous-completion)
              (<span class="org-string">"C-c c f"</span>     . copilot-accept-completion-by-word)
              (<span class="org-string">"C-c c e"</span>     . copilot-accept-completion-by-line)
              (<span class="org-string">"C-c &lt;SPC&gt;"</span>   . copilot-accept-completion)
              (<span class="org-string">"C-c c &lt;SPC&gt;"</span> . copilot-accept-completion)
              (<span class="org-string">"C-c C-&lt;SPC&gt;"</span> . copilot-accept-completion)
              (<span class="org-string">"C-c c t"</span>     . copilot-toggle-auto-complete)))

(<span class="org-keyword">use-package</span> ediff
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:commands</span> (ediff-buffers ediff-files ediff-buffers3 ediff-files3)
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> ediff-split-window-function 'split-window-horizontally)
  (<span class="org-keyword">setq</span> ediff-window-setup-function 'ediff-setup-windows-plain)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> ediff-keep-variants nil)
  (<span class="org-keyword">setq</span> ediff-make-buffers-readonly-at-startup nil)
  (<span class="org-keyword">setq</span> ediff-merge-revisions-with-ancestor t)
  (<span class="org-keyword">setq</span> ediff-show-clashes-only t))

(<span class="org-keyword">use-package</span> yasnippet
  <span class="org-builtin">:hook</span>
  (prog-mode . yas-minor-mode))

<span class="org-comment-delimiter">;; </span><span class="org-comment">(use-package smart-hungry-delete
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:ensure t
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:bind (([remap backward-delete-char-untabify] . smart-hungry-delete-backward-char)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ([remap delete-backward-char] . smart-hungry-delete-backward-char)
</span><span class="org-comment-delimiter">;;</span><span class="org-comment">               ([remap delete-char] . smart-hungry-delete-forward-char))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:init (smart-hungry-delete-add-default-hooks))
</span>
(<span class="org-keyword">use-package</span> whitespace
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:defer</span> t
  <span class="org-comment-delimiter">;; </span><span class="org-comment">:hook (before-save . whitespace-cleanup)
</span>  )

(<span class="org-keyword">provide</span> '<span class="org-constant">prog-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">prog-conf.el ends here</span>
</pre>
</div>
</div>
</div>
