emacs-configs.html

<div id="outline-container-org680ad3f" class="outline-2">
<h2 id="org680ad3f"><span class="section-number-2">10.</span> Miscellaneous</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">misc-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">use-package</span> notmuch
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> mail-user-agent 'notmuch-user-agent))

(<span class="org-keyword">setq</span> user-full-name (getenv <span class="org-string">"USER_FULL_NAME"</span>)
        user-mail-address (getenv <span class="org-string">"USER_EMAIL"</span>)
        auth-sources '(<span class="org-string">"~/.authinfo.gpg"</span>))
(<span class="org-keyword">setq</span> send-mail-function 'sendmail-send-it
        message-send-mail-function 'sendmail-send-it
        sendmail-program (executable-find <span class="org-string">"msmtp"</span>)
        message-send-mail-function 'message-send-mail-with-sendmail)
(<span class="org-keyword">provide</span> '<span class="org-constant">misc-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">misc-conf.el ends here</span>
</pre>
</div>

<p>
Some extra stuff.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> ejc-sql
  <span class="org-builtin">:custom</span>
  (clomacs-httpd-default-port 8888)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">let</span> ((ojdbc-path <span class="org-string">"~/.m2/repository/com/oracle/ojdbc8/8/ojdbc8-8.jar"</span>)
          (maria-path <span class="org-string">"~/.m2/repository/org/mariadb/jdbc/mariadb-java-client/2.6.2/mariadb-java-client-2.6.2.jar"</span>))
    (ejc-create-connection
     <span class="org-string">"ERP10 20419"</span>
     <span class="org-builtin">:classpath</span>      ojdbc-path
     <span class="org-builtin">:connection-uri</span> (concat <span class="org-string">"jdbc:oracle:thin:@"</span>
                             (getenv <span class="org-string">"X20419_DB_HOST"</span>) <span class="org-string">":"</span>
                             (getenv <span class="org-string">"X20419_DB_PORT"</span>) <span class="org-string">":"</span>
                             (getenv <span class="org-string">"X20419_DB_NAME"</span>))
     <span class="org-builtin">:user</span>           (getenv <span class="org-string">"X20419_DB_USERNAME"</span>)
     <span class="org-builtin">:password</span>       (getenv <span class="org-string">"X20419_DB_PASSWORD"</span>)
     <span class="org-builtin">:separator</span>      <span class="org-string">"/"</span>)
    (ejc-create-connection
     <span class="org-string">"ERP10 20313"</span>
     <span class="org-builtin">:classpath</span>      maria-path
     <span class="org-builtin">:connection-uri</span> <span class="org-string">"jdbc:mariadb://uri:port/dbname"</span>
     <span class="org-builtin">:user</span>           <span class="org-string">"USER_ID"</span>
     <span class="org-builtin">:password</span>       <span class="org-string">"PASSWORD"</span>
     <span class="org-builtin">:separator</span>      <span class="org-string">"/"</span>)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> gptel
      <span class="org-builtin">:custom</span>
      (gptel-default-mode 'org-mode)
      (gptel-backend (gptel-make-gemini <span class="org-string">"Gemini"</span> <span class="org-builtin">:key</span> <span class="org-string">"Gemini_API_Key"</span> <span class="org-builtin">:stream</span> t)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">package-setup-function.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">setup-eat</span> ()
  <span class="org-doc">"Setup `</span><span class="org-doc"><span class="org-constant">eat</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">use-package</span> eat))

(<span class="org-keyword">defun</span> <span class="org-function-name">setup-dumb-jump</span> ()
  <span class="org-doc">"Setup `</span><span class="org-doc"><span class="org-constant">dumb-jump</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">use-package</span> dumb-jump))

(<span class="org-keyword">defun</span> <span class="org-function-name">set-up-restclient</span> ()
  <span class="org-doc">"Usage:
:header = &lt;&lt;
Content-Type: application/json
X-Authenticate-Token: :token
#

GET http://localhost:8080/api/list
:header
#

POST http://localhost:8080/api/login
Content-Type: application/x-www-form-urlencoded
-&gt; jq-set-var :token .data.access_token

userid=userid&amp;password=1111
#

for more details
https://github.com/pashky/restclient.el/"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">use-package</span> restclient)
  (<span class="org-keyword">use-package</span> restclient-jq))

(<span class="org-keyword">defun</span> <span class="org-function-name">restclient-scratch-buffer</span>()
  <span class="org-doc">"Make `</span><span class="org-doc"><span class="org-constant">restclient-mode</span></span><span class="org-doc">' buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (switch-to-buffer (get-buffer-create <span class="org-string">"*scratch-restclient*"</span>))
  (restclient-mode))

(<span class="org-keyword">defun</span> <span class="org-function-name">setup-request</span> ()
  <span class="org-doc">"Setup `</span><span class="org-doc"><span class="org-constant">request</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">use-package</span> request))

<span class="org-comment-delimiter">;; </span><span class="org-comment">(request "http://localhost:8080/api/CM/AccountService/login"
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:type "POST"
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">;; :headers '(("Content-Type" . "application/x-www-form-urlencoded"))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:data '(("userid" . "userid") ("password" . "password"))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:parser 'json-read
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:success (cl-function
</span><span class="org-comment-delimiter">;;             </span><span class="org-comment">(lambda (&amp;key data &amp;allow-other-keys)
</span><span class="org-comment-delimiter">;;               </span><span class="org-comment">(setq token (assoc-default 'access_token (assoc-default 'data data))))))
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(request "http://localhost:8080/api/HR/Evarpt00400_Z20313Service/listMenu"
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:headers `(("Content-Type" . "application/json")
</span><span class="org-comment-delimiter">;;              </span><span class="org-comment">("X-Authenticate-Token" . ,token))
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:parser 'json-read
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">:success (cl-function
</span><span class="org-comment-delimiter">;;             </span><span class="org-comment">(lambda (&amp;key data &amp;allow-other-keys)
</span><span class="org-comment-delimiter">;;               </span><span class="org-comment">(message "%S" (recurse-alist (assoc-default 'data data))))))
</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">setup-geiser-guile</span> ()
  <span class="org-doc">"Setup `</span><span class="org-doc"><span class="org-constant">geiser-guile</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">use-package</span> geiser-guile
      <span class="org-builtin">:config</span>
      (<span class="org-keyword">setq</span> geiser-scheme-implementation 'guile)))

(<span class="org-keyword">defun</span> <span class="org-function-name">setup-pyvenv</span> ()
  <span class="org-doc">"Setup `</span><span class="org-doc"><span class="org-constant">pyvenv</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">use-package</span> pyvenv))

(<span class="org-keyword">defun</span> <span class="org-function-name">setup-emmet-mode</span> ()
  <span class="org-doc">"Setup `</span><span class="org-doc"><span class="org-constant">emmet-mode</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">use-package</span> emmet-mode
      <span class="org-builtin">:hook</span>
      (mhtml-mode . emmet-mode)))

(<span class="org-keyword">use-package</span> denote
  <span class="org-builtin">:custom</span>
  (denote-sort-keywords t)
  (denote-directory (expand-file-name <span class="org-string">"~/Documents/notes/denote/"</span>))
  (denote-prompts '(file-type subdirectory title keywords))
  <span class="org-builtin">:hook</span>
  (dired-mode . denote-dired-mode))

(<span class="org-keyword">provide</span> '<span class="org-constant">package-setup-function</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">package-setup-function.el ends here</span>
</pre>
</div>
</div>
</div>
