content/emacs-configs.org
* Linux

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/linux-conf.el
  ;;; linux-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (defun m180/font-set ()
    "Font settings for linux."
    (set-face-attribute 'default nil :family "Iosevka Nerd Font Mono" :height 120 :weight 'light)
    (set-fontset-font t 'hangul (font-spec :name "NotoSansKR")))

  (if (daemonp)
  	(add-hook 'server-after-make-frame-hook #'m180/font-set)
    (m180/font-set))

  (provide 'linux-conf)
  ;;; linux-conf.el ends here
#+end_src

* MacOS

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/macos-conf.el
  ;;; macos-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (defun m180/font-set ()
    "Font settings for MacOS."
    (set-face-attribute 'default nil :family "Iosevka Nerd Font Mono" :height 160 :weight 'extra-light)
    (set-fontset-font t 'hangul (font-spec :name "NotoSansKR")))

  (if (daemonp)
  	(add-hook 'server-after-make-frame-hook #'m180/font-set)
    (m180/font-set))

  (setq insert-directory-program "gls")
  (setq mac-command-modifier 'meta)

  (when (executable-find "zsh")
    (setenv "SHELL" (executable-find "zsh")))

  (provide 'macos-conf)
  ;;; macos-conf.el ends here
#+end_src

* Windows

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/windows-conf.el
  ;;; windows-conf.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (defun m180/font-set ()
    "Font set for Windows."
    (set-face-attribute 'default nil :family "Iosevka NFM" :height 120 :weight 'light)
    (set-fontset-font t 'hangul (font-spec :name "Noto Sans KR")))

  (if (daemonp)
  	  (add-hook 'server-after-make-frame-hook #'m180/font-set)
  	(m180/font-set))

  (setq explicit-shell-file-name (executable-find "pwsh"))
  (setq shell-file-name (executable-find "pwsh"))
  (setq grep-use-null-device nil)

  ;; (defun pwsh-shell-mode-setup ()
    ;; "Powershell setup for Windows."
    ;; (setq-local comint-prompt-read-only t)
    ;; (setq-local comint-process-echoes t))
  ;; (add-hook 'shell-mode-hook #'pwsh-shell-mode-setup)
  ;; (setq eshell-windows-shell-file (executable-find "pwsh"))
  ;; (setq explicit-shell-file-name (executable-find "pwsh"))
  ;; (setq shell-file-name (executable-find "pwsh"))
  ;; (setenv "SHELL" shell-file-name)

  (provide 'windows-conf)
  ;;; windows-conf.el ends here
#+end_src

* Douzone                                                                       :noexport:

** Config

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/douzone-comet-config.el
  ;;; douzone-comet-config.el --- Summary -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (defun switch-properties (drs)
    "Switch db.properties configs by DRS.
  `(switch-properties DRS_CODE)'
  empty string parameter comments out all the DRS configs."
    (interactive "s")
    (with-current-buffer "db.properties"
  	(goto-char (point-min))
  	(setq-local sp--curr-drs "")
  	(while (not (eobp))
  	  (let ((line (buffer-substring-no-properties (point) (line-end-position))))
	  (if (and (not (string-empty-p line)) (string= (substring line 0 2) "#="))
	      (setq sp--curr-drs (substring line 2))
	    (if (and (not (string-empty-p line)) (not (string-empty-p sp--curr-drs)))
		(if (and (not (string-empty-p drs)) (string= drs sp--curr-drs))
		    (uncomment-region (line-beginning-position) (line-end-position))
		  (unless (string= "#" (substring line 0 1))
		    (comment-region (line-beginning-position) (line-end-position))))))
	  (forward-line 1)))
  	(save-buffer)))

  (provide 'douzone-comet-config)
  ;;; douzone-comet-config.el ends here
#+end_src

** Service

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/douzone-comet-service.el
  ;;; douzone-comet-service.el -- Summary -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (defun fu/dz--model-text->field ()
    "Open line separate list to douzone model field."
    (interactive)
    (while (not (eobp))
      (let ((field (buffer-substring-no-properties (point-at-bol) (point-at-eol))))
	(delete-region (point-at-bol) (point-at-eol))
	(beginning-of-line)
	(insert (format "@SerializedName(\"%s\")\n" field))
	(insert (format "@DzModelField(name = \"%s\", desc = \"\", colName = \"%s\")\n" field field))
	(insert (format "private String %s;\n" (downcase field)))
	(forward-line 1))))

  (defun fu/find-fat-jar ()
    "Find the fat JAR file inside target directory."
    (let* ((dir        (cond ((project-current) (project-root (project-current)))
			     ((buffer-file-name) (file-name-directory (buffer-file-name)))
			     (t default-directory)))
	   (target-dir (expand-file-name "target" dir))
	   (files      (if (file-exists-p target-dir)
			   (directory-files target-dir t "\\.jar$"))))
      (car (sort files #'string>))))

  (defun fu/spring-boot:run-jar ()
    "Test."
    (interactive)
    (let ((jar  (fu/find-fat-jar))
	  (java (expand-file-name "bin/java" (getenv "JAVA8_HOME"))))
  	(if jar (progn
		(message "Running: java -jar %s" jar)
		(async-shell-command (format "%s -jar %s" java jar) "*spring-boot*")
		(display-buffer "*spring-boot*")))))

  (provide 'douzone-comet-service)
  ;;; douzone-comet-service.el ends here
#+end_src

** UI

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/douzone-comet-ui.el
  ;;; douzone-comet-ui.el --- Summary  -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (defun fu/dz--copy-to-dews-web (module)
    "Copy file to dews-web repository.
  `TYPE' = html / css / js,
  `MODULE' = CX / CZ / HR."
    (let* ((base-path   (expand-file-name "Projects/douzone-comet-webapp-boot/dews-web/repository/view" (getenv "HOME")))
	   (src-file    (f-filename (buffer-file-name)))
	   (src         (buffer-file-name))
	   (dest-type   (expand-file-name (file-name-extension (if src-file src-file "")) base-path))
	   (dest-module (expand-file-name module dest-type))
	   (dest        (expand-file-name src-file dest-module)))
  	(message "src: %s, dest: %s" src dest)
  	(copy-file src dest t)))

  (defun fu/dz--copy-to-cx ()
    "Copy file to CX directory."
    (interactive)
    (fu/dz--copy-to-dews-web "CX"))

  (defun fu/dz--copy-to-cz ()
    "Copy file to CZ directory."
    (interactive)
    (fu/dz--copy-to-dews-web "CZ"))

  (defun fu/dz--copy-to-hr ()
    "Copy file to HR directory."
    (interactive)
    (fu/dz--copy-to-dews-web "HR"))

  (provide 'douzone-comet-ui)
  ;;; douzone-comet-ui.el ends here
#+end_src

* Local File Variables                                                          :noexport:

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
