emacs-configs.html

<div id="outline-container-org7db2ec4" class="outline-2">
<h2 id="org7db2ec4"><span class="section-number-2">11.</span> Linux</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">linux-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">m180/font-set</span> ()
  <span class="org-doc">"Font settings for linux."</span>
  (set-face-attribute 'default nil <span class="org-builtin">:family</span> <span class="org-string">"Iosevka Nerd Font Mono"</span> <span class="org-builtin">:height</span> 120 <span class="org-builtin">:weight</span> 'light)
  (set-fontset-font t 'hangul (font-spec <span class="org-builtin">:name</span> <span class="org-string">"NotoSansKR"</span>)))

(<span class="org-keyword">if</span> (daemonp)
      (add-hook 'server-after-make-frame-hook #'m180/font-set)
  (m180/font-set))

(<span class="org-keyword">provide</span> '<span class="org-constant">linux-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">linux-conf.el ends here</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd49250d" class="outline-2">
<h2 id="orgd49250d"><span class="section-number-2">12.</span> MacOS</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">macos-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">m180/font-set</span> ()
  <span class="org-doc">"Font settings for MacOS."</span>
  (set-face-attribute 'default nil <span class="org-builtin">:family</span> <span class="org-string">"Iosevka Nerd Font Mono"</span> <span class="org-builtin">:height</span> 160 <span class="org-builtin">:weight</span> 'extra-light)
  (set-fontset-font t 'hangul (font-spec <span class="org-builtin">:name</span> <span class="org-string">"NotoSansKR"</span>)))

(<span class="org-keyword">if</span> (daemonp)
      (add-hook 'server-after-make-frame-hook #'m180/font-set)
  (m180/font-set))

(<span class="org-keyword">setq</span> insert-directory-program <span class="org-string">"gls"</span>)
(<span class="org-keyword">setq</span> mac-command-modifier 'meta)

(<span class="org-keyword">when</span> (executable-find <span class="org-string">"zsh"</span>)
  (setenv <span class="org-string">"SHELL"</span> (executable-find <span class="org-string">"zsh"</span>)))

(<span class="org-keyword">provide</span> '<span class="org-constant">macos-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">macos-conf.el ends here</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b17a99" class="outline-2">
<h2 id="org6b17a99"><span class="section-number-2">13.</span> Windows</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">windows-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">m180/font-set</span> ()
  <span class="org-doc">"Font set for Windows."</span>
  (set-face-attribute 'default nil <span class="org-builtin">:family</span> <span class="org-string">"Iosevka NFM"</span> <span class="org-builtin">:height</span> 120 <span class="org-builtin">:weight</span> 'light)
  (set-fontset-font t 'hangul (font-spec <span class="org-builtin">:name</span> <span class="org-string">"Noto Sans KR"</span>)))

(<span class="org-keyword">if</span> (daemonp)
        (add-hook 'server-after-make-frame-hook #'m180/font-set)
      (m180/font-set))

(<span class="org-keyword">setq</span> explicit-shell-file-name (executable-find <span class="org-string">"pwsh"</span>))
(<span class="org-keyword">setq</span> shell-file-name (executable-find <span class="org-string">"pwsh"</span>))
(<span class="org-keyword">setq</span> grep-use-null-device nil)

<span class="org-comment-delimiter">;; </span><span class="org-comment">(defun pwsh-shell-mode-setup ()
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">"Powershell setup for Windows."
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq-local comint-prompt-read-only t)
</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq-local comint-process-echoes t))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'shell-mode-hook #'pwsh-shell-mode-setup)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq eshell-windows-shell-file (executable-find "pwsh"))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq explicit-shell-file-name (executable-find "pwsh"))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setq shell-file-name (executable-find "pwsh"))
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(setenv "SHELL" shell-file-name)
</span>
(<span class="org-keyword">provide</span> '<span class="org-constant">windows-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">windows-conf.el ends here</span>
</pre>
</div>
</div>
</div>
</main>
</body>
</html>
